# **[2] 정형 데이터 활용**

**[학습 목표]**
1. 정형 데이터의 형태와 특징에 대해 이해할 수 있다.  
2. 정형 데이터의 구조를 살펴보고 활용하기 쉽게 전처리할 수 있다.

## **1. 정형 데이터**

정형 데이터는 미리 정해 놓은 형식과 구조에 따라 저장되도록 구성된 데이터입니다.  
표 형태로 나타낸 것이 정형 데이터로, 영상이나 언어 등의 비정형 데이터와 다른 구조입니다.  
정형 데이터가 가지는 특징이 무엇인지, 어떻게 활용할 수 있을지 알아봅시다.

<table>
<tr>
    <th><img src="https://drive.google.com/uc?id=1LY6nnPdgu9zU4Pr-6Hc2oA7j2XqxYURX" width=\"750\"></th>
    </tr>
<tr>
    <th>정형 데이터와 비정형 데이터</th>
</tr>
</table>

### **(1) 정형 데이터의 특징**

> 정형 데이터는 표와 같이 명확한 구조를 가지고 있어서 여러 장점이 있습니다.
> * 행과 열로 모든 데이터를 표현할 수 있어, **컴퓨터가 접근**하기 쉬워요.
> * 데이터를 수집하거나 수정하는 등 **관리하기 편리**해요.
> * 데이터가 체계적으로 저장되어서 **저장 공간**이 많이 필요하지 않아요. 
> * 각 열마다 **공통된 속성**(**숫자, 문자열, 날짜 등**)을 가지기 때문에 필요한 특징을 분석하기 쉬워요.
>
>

<table>
<tr>
    <th><img src="https://drive.google.com/uc?id=1LTqGWNgpNsV_o6kDsPj1YBiPwsfsfiVP" width=\"750\"></th>
    </tr>
<tr>
    <th>정형 데이터의 특징</th>
</tr>
</table>

### **(2) 정형 데이터 수집**

> 인공지능 학습에 사용하는 정형 데이터를 제공하는 여러 사이트가 있어요.  
> 여기서는 대표적으로 두 가지 예시를 소개할게요.   
> * 공공 데이터 포털(https://www.data.go.kr/): 다양한 분야의 데이터가 있지만, 때때로 값이 고르지 못해 전처리 과정이 필요하기도 해요.
> * 캐글(https://www.kaggle.com/): 주어진 데이터로 과제를 해결하기 위한 대회 플랫폼이에요. 대회를 위한 데이터를 제공하기 때문에 어느 정도 전처리가 되어 있습니다.

### **(3) 정형 데이터의 형태**

> 정형 데이터의 형태는 CSV(Comma Separated Values), 관계형 데이터베이스, 스프레드시트 등 여러 가지가 있어요.  
> 대표적인 예시인 CSV는, 아래와 같이 각 데이터 값을 쉼표로 구분하는 형태입니다.

<table>
<tr>
    <th><img src="/" width=\"750\"></th>
    </tr>
<tr>
    <th>CSV 파일의 형태</th>
</tr>
</table>

## **2. 데이터 전처리**

### **(1) pandas 라이브러리**

> pandas는 데이터를 분석하기 위한 python 라이브러리에요.  
> pandas를 활용하여, python으로 엑셀을 다루듯이 데이터 구조를 만들고 다룰 수 있습니다.  
>
> * python만으로 데이터를 분석할 때보다 속도가 빨라요.
> * 누락된 데이터를 처리하기 용이해요.
> * 데이터 구조에 수정, 삽입 등 변형이 자유로워요.

### **(2) 데이터 전처리 실습하기**

pandas를 사용하여 실제로 정형 데이터를 확인하고 누락된 데이터를 전처리해봅시다.  
1912년 타이타닉호 침몰 사고의 실제 데이터를 활용하여 어떤 정보가 있는지 살펴보겠습니다.

In [15]:
import pandas as pd
titanic = pd.read_csv("titanic.csv")

In [16]:
print('titanic 데이터 프레임의 크기:', titanic.shape)
print('*************************')
print('titanic 데이터 프레임의 정보:')
print(titanic.info( ))

titanic 데이터 프레임의 크기: (891, 12)
*************************
titanic 데이터 프레임의 정보:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [17]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [18]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
print('*** titanic 데이터 프레임의 속성 이름 ***')
print(titanic.columns)
print('*** titanic 데이터 프레임의 인덱스 정보 ***')
print(titanic.index)

*** titanic 데이터 프레임의 속성 이름 ***
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
*** titanic 데이터 프레임의 인덱스 정보 ***
RangeIndex(start=0, stop=891, step=1)

In [20]:
print('titanic 데이터 프레임의 속성별 고유한 데이터의 개수')
titanic.nunique( )

titanic 데이터 프레임의 속성별 고유한 데이터의 개수

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [21]:
titanic['Survived'].unique( )
titanic['Sex'].unique( )
titanic['Pclass'].unique( )
titanic['Embarked'].unique( )

array(['S', 'C', 'Q', nan], dtype=object)

In [22]:
# 결측치 확인
titanic.isnull( ).sum( )

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [28]:
titanic[["Age", "Cabin", "Embarked"]].head(10)

         Age Cabin Embarked
0  22.000000   NaN        S
1  38.000000   C85        C
2  26.000000   NaN        S
3  35.000000  C123        S
4  35.000000   NaN        S
5  29.699118   NaN        Q
6  54.000000   E46        S
7   2.000000   NaN        S
8  27.000000   NaN        S
9  14.000000   NaN        C

In [23]:
titanic['Age'] = titanic['Age'].fillna(titanic['Age'].mean( ))

In [30]:
titanic.groupby('Embarked')['PassengerId'].count( )

Embarked
C    168
Q     77
S    646
Name: PassengerId, dtype: int64

In [31]:
titanic['Embarked'] = titanic['Embarked'].fillna('S')

In [25]:
# 결측치 확인
titanic.isnull( ).sum( )

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [26]:
titanic.to_csv('titanic_preprocess.csv')